{
  "backend/main.mo": "Motoko actor defining vocabulary data structures (VocabularyWord, Question, UserStats) and a hardcoded list of 15+ GRE vocabulary words with definitions, parts of speech, example sentences, difficulty levels, and categories.",
  "feature_evidence.json": "Empty feature evidence report with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React components, pages, hooks, and configuration files describing routing, UI components, state management, and styling.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining background, foreground, card, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the GRE Vocabulary Builder application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, flashcards, practice test, progress, and settings pages, wrapped in ThemeProvider and Layout with Toaster and notification hook.",
  "frontend/src/components/FlashcardViewer.tsx": "Interactive flashcard component with 3D flip animation showing vocabulary word on front and definition on back, with navigation controls and loading states using useGetPracticeQuestion hook.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing sticky header with logo and navigation (desktop/mobile menu), main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/NotificationSettings.tsx": "Settings component managing browser notification permissions, daily reminder toggle, time picker for notification scheduling, and test notification button with localStorage persistence.",
  "frontend/src/components/PracticeTest.tsx": "React component that renders an interactive practice test with multiple-choice questions, tracks score and progress, shows feedback for correct/incorrect answers, and calls onComplete when the test finishes.",
  "frontend/src/components/ProgressDashboard.tsx": "Dashboard component displaying user statistics including words learned, accuracy rate, total attempts, and correct answers with progress bars and stat cards using data from useUserProgress hook.",
  "frontend/src/components/TestResults.tsx": "Results screen component that displays test score, percentage, performance message, and action buttons to retake the test or return home.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor with Internet Identity authentication, automatically invalidating and refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useNotifications.ts": "Hook that schedules daily browser notifications at a user-configured time to remind them to study, with click navigation to flashcards page.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching practice questions, submitting answers, and retrieving user statistics from the backend actor with cache invalidation.",
  "frontend/src/hooks/useUserProgress.ts": "Simple hook that combines useInternetIdentity and useGetUserStats to fetch the current authenticated user's progress statistics.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm academic color palette (burgundy, cream, forest green) for both light and dark modes, plus utility classes for 3D card transformations.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/FlashcardsPage.tsx": "Page component that displays the FlashcardViewer component with a header card explaining the flashcard study session.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards (Flashcards, Practice Tests, Progress), and statistics section showcasing the app's value proposition.",
  "frontend/src/pages/PracticeTestPage.tsx": "Page managing practice test flow with test configuration (number of questions), test execution via PracticeTest component, and results display via TestResults component.",
  "frontend/src/pages/ProgressPage.tsx": "Page displaying the ProgressDashboard component with a header card for tracking user learning statistics.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page containing the NotificationSettings component for customizing user preferences.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (burgundy, forest green, cream), typography, border radius, shadows, and animations for the academic-themed UI.",
  "project_state.json": "Project metadata tracking implemented features (flashcards, practice tests, progress tracking, notifications, UI design), known issues (empty words list), and pending feature requests including populating 3000 GRE words."
}